app/controllers/tweeets_controller.rb

  def index
    @tweeets = Tweeet.all.order("created_at DESC")
---
SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC

  def create
    @tweeet = current_user.tweeets.build(tweeet_params)

    respond_to do |format|
      if @tweeet.save
---
INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweeet", "Hello, Ivan!"], ["created_at", "2019-02-28 16:17:14.316105"], ["updated_at", "2019-02-28 16:17:14.316105"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @tweeet.update(tweeet_params)
---
UPDATE "tweeets" SET "tweeet" = ?, "updated_at" = ? WHERE "tweeets"."id" = ?  [["tweeet", "Hello, world!"], ["updated_at", "2019-02-28 18:26:41.199853"], ["id", 11]]

  def destroy
    @tweeet.destroy
---
DELETE FROM "tweeets" WHERE "tweeets"."id" = ?  [["id", 7]]

    def set_tweeet
      @tweeet = Tweeet.find(params[:id])
---
SELECT  "tweeets".* FROM "tweeets" WHERE "tweeets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]